
//&AtClient
//Procedure Изображение()
//	ПутьКФото = "";
//	ТекстХТМЛ="
//    |<!DO CTYPE html>
//    |<ht ml>
//    |<center>
//    |";
//    ТекстХТМЛ=ТекстХТМЛ+"
//    |<img src=""data:image/jpeg;base64,
//    |";
//    ТекстХТМЛ=ТекстХТМЛ+Base64Строка(Новый ДвоичныеДанные(ПутьКФото));
//    ТекстХТМЛ=ТекстХТМЛ+"
//    |"" style=""width:298px; height:198px""; align-items:center; alt="""" />
//    |</center>
//    |</html>
//    |";

//    
//  ЭлементыФормы.ПолеHTMLДокумента1.УстановитьТекст(ТекстХТМЛ);
//	
//EndProcedure
